apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_slave.c
#ifdef CONFIG_ESP32S3_SPI_DMA
static void spislave_setup_tx_dma(struct spislave_priv_s *priv)
{
  esp32s3_dma_setup(priv->dma_txdesc,
                    SPI_DMA_DESC_NUM,
                    priv->tx_buffer,
                    SPI_SLAVE_BUFSIZE,
                    true, priv->dma_channel);
  esp32s3_dma_load(priv->dma_txdesc, priv->dma_channel, true);

  spislave_dma_tx_fifo_reset(priv);

  spislave_peripheral_reset(priv);

  /* Clear output FIFO empty error */

  setbits(SPI_DMA_OUTFIFO_EMPTY_ERR_INT_CLR_M,
          SPI_DMA_INT_CLR_REG(priv->config->id));

  /* Enable SPI DMA TX */

  setbits(SPI_DMA_TX_ENA_M, SPI_DMA_CONF_REG(priv->config->id));

  esp32s3_dma_enable(priv->dma_channel, true);
}
#endif

/****************************************************************************
 * Name: spislave_prepare_next_tx
 *
 * Description:
 *   Prepare the SPI Slave controller for transmitting data on the next
 *   transaction.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_prepare_next_tx(struct spislave_priv_s *priv)
{
  if (priv->tx_length != 0)
    {
#ifdef CONFIG_ESP32S3_SPI_DMA
      spislave_setup_tx_dma(priv);
#else
      spislave_peripheral_reset(priv);

      spislave_write_tx_buffer(priv);

      spislave_cpu_tx_fifo_reset(priv);
#endif

      priv->is_tx_enabled = true;
    }
  else
    {
      spiwarn("TX buffer empty! Disabling TX for next transaction\n");

      spislave_cpu_tx_fifo_reset(priv);

      priv->is_tx_enabled = false;
    }
}

/****************************************************************************
 * Name: spislave_periph_interrupt
 *
 * Description:
 *   Handler for the SPI Slave controller interrupt which is triggered when a
 *   transfer is finished.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI Slave controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

static int spislave_periph_interrupt(int irq, void *context, void *arg)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)arg;
  uint32_t regval = getreg32(SPI_SLAVE1_REG(priv->config->id));
  uint32_t transfer_size = REG_MASK(regval, SPI_SLV_DATA_BITLEN) / 8;

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
  uint32_t int_clear = 0;
  uint32_t int_status = getreg32(SPI_DMA_INT_ST_REG(priv->config->id));
#else
  uint32_t int_clear = SPI_TRANS_DONE_INT_CLR_M;
#endif

  if (!priv->is_processing)
    {
      SPIS_DEV_SELECT(priv->dev, true);
      priv->is_processing = true;
    }

  /* RX process */

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
  if (int_status & SPI_SLV_INT_RX)
    {
#endif
      if (transfer_size > 0)
        {
          spislave_store_result(priv, transfer_size);
          SPIS_DEV_NOTIFY(priv->dev, SPISLAVE_RX_COMPLETE);
        }

#ifdef CONFIG_ESP32S3_SPI_DMA
      spislave_prepare_next_rx(priv);
#endif

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
      int_clear |= SPI_SLV_INT_CLR_RX;
    }
#endif

  /* TX process */

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
  if (int_status & SPI_SLV_INT_TX)
    {
#endif
      if (priv->is_tx_enabled && transfer_size > 0)
        {
          spislave_evict_sent_data(priv, transfer_size);
          SPIS_DEV_NOTIFY(priv->dev, SPISLAVE_TX_COMPLETE);
        }

      spislave_prepare_next_tx(priv);

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
      int_clear |= SPI_SLV_INT_CLR_TX;
    }
#endif

  if (priv->is_processing && esp_gpioread(priv->config->cs_pin))
    {
      priv->is_processing = false;
      SPIS_DEV_SELECT(priv->dev, false);
    }

  /* Clear the trans_done interrupt flag */

  setbits(int_clear, SPI_DMA_INT_CLR_REG(priv->config->id));

  /* Trigger the start of user-defined transaction */

#ifndef CONFIG_ESP32S3_SPI_IO_QIO
  setbits(SPI_USR_M, SPI_CMD_REG(priv->config->id));
#endif

  return 0;
}

/****************************************************************************
 * Name: spislave_dma_init
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave connection to GDMA engine.
 *
 * Input Parameters:
 *   priv   - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_DMA
static int spislave_dma_init(struct spislave_priv_s *priv)
{
  /* Enable GDMA clock for the SPI peripheral */

  setbits(priv->config->dma_clk_bit, SYSTEM_PERIP_CLK_EN0_REG);

  /* Reset GDMA for the SPI peripheral */

  resetbits(priv->config->dma_rst_bit, SYSTEM_PERIP_RST_EN0_REG);

  /* Request a GDMA channel for SPI peripheral */

  priv->dma_channel = esp32s3_dma_request(priv->config->dma_periph, 1, 1,
                                          true);
  if (priv->dma_channel < 0)
    {
      spierr("Failed to allocate GDMA channel\n");
      return ERROR;
    }

  /* Disable segment transaction mode for SPI Slave */

  resetbits(SPI_DMA_SLV_SEG_TRANS_EN_M, SPI_DMA_CONF_REG(priv->config->id));

  /* Configure DMA In-Link EOF to be generated by trans_done */

  resetbits(SPI_RX_EOF_EN_M, SPI_DMA_CONF_REG(priv->config->id));

  return OK;
}

/****************************************************************************
 * Name: spislave_dma_deinit
 *
 * Description:
 *   Deinitialize ESP32-S3 SPI slave GDMA engine.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void spislave_dma_deinit(struct spislave_priv_s *priv)
{
  /* Release a DMA channel from peripheral */

  esp32s3_dma_release(priv->dma_channel);

  /* Disable DMA clock for the SPI peripheral */

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->dma_clk_bit, 0);
}
#endif

/****************************************************************************
 * Name: spislave_initializ_iomux
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave GPIO by IO MUX.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if SPI_VIA_IOMUX != 0
static void spislave_initializ_iomux(struct spislave_priv_s *priv)
{
  uint32_t attr = INPUT_FUNCTION_5 | DRIVE_0;
  const struct spislave_config_s *config = priv->config;

  esp_configgpio(config->cs_pin,  attr);
  esp_configgpio(config->clk_pin, attr);

  esp_gpio_matrix_out(config->cs_pin,   SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->clk_pin,  SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
  attr |= OUTPUT;

  esp_configgpio(config->mosi_pin, attr);
  esp_configgpio(config->miso_pin, attr);
  esp_configgpio(config->io2_pin,  attr);
  esp_configgpio(config->io3_pin,  attr);

  esp_gpio_matrix_out(config->io2_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->io3_pin, SIG_GPIO_OUT_IDX, 0, 0);
#else
  esp_configgpio(config->mosi_pin, attr);
  esp_configgpio(config->miso_pin, OUTPUT_FUNCTION_5);
#endif
}
#endif

/****************************************************************************
 * Name: spislave_initializ_iomatrix
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave GPIO by IO matrix.
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if SPI_VIA_IOMUX == 0 || defined(CONFIG_ESP32S3_SPI3)
static void spislave_initializ_iomatrix(struct spislave_priv_s *priv)
{
  uint32_t attr = INPUT | DRIVE_0;
  const struct spislave_config_s *config = priv->config;

  esp_configgpio(config->cs_pin, attr | RISING);
  esp_gpio_matrix_in(config->cs_pin, config->cs_insig, 0);

