apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_slave.c
  esp_configgpio(config->clk_pin, attr);
  esp_gpio_matrix_in(config->clk_pin, config->clk_insig, 0);

#  ifdef CONFIG_ESP32S3_SPI_IO_QIO
  attr |= OUTPUT;

  esp_configgpio(config->mosi_pin, attr);
  esp_gpio_matrix_in(config->mosi_pin, config->mosi_insig, 0);
  esp_gpio_matrix_out(config->mosi_pin, config->mosi_outsig, 0, 0);

  esp_configgpio(config->miso_pin, attr);
  esp_gpio_matrix_in(config->miso_pin, config->miso_insig, 0);
  esp_gpio_matrix_out(config->miso_pin, config->miso_outsig, 0, 0);

  esp_configgpio(config->io2_pin, attr);
  esp_gpio_matrix_in(config->io2_pin, config->io2_insig, 0);
  esp_gpio_matrix_out(config->io2_pin, config->io2_outsig, 0, 0);

  esp_configgpio(config->io3_pin, attr);
  esp_gpio_matrix_in(config->io3_pin, config->io3_insig, 0);
  esp_gpio_matrix_out(config->io3_pin, config->io3_outsig, 0, 0);
#  else
  esp_configgpio(config->mosi_pin, attr);
  esp_gpio_matrix_in(config->mosi_pin, config->mosi_insig, 0);

  esp_configgpio(config->miso_pin, OUTPUT);
  esp_gpio_matrix_out(config->miso_pin, config->miso_outsig, 0, 0);
#  endif
}
#endif

/****************************************************************************
 * Name: spislave_gpio_initialize
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave GPIO
 *
 * Input Parameters:
 *   priv - Private SPI Slave controller structure
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_gpio_initialize(struct spislave_priv_s *priv)
{
#if SPI_VIA_IOMUX != 0
  if (priv->config->id == 2)
    {
      spislave_initializ_iomux(priv);
    }
#  ifdef CONFIG_ESP32S3_SPI3
  else
    {
      spislave_initializ_iomatrix(priv);
    }
#  endif
#else
  spislave_initializ_iomatrix(priv);
#endif
}

/****************************************************************************
 * Name: spislave_initialize
 *
 * Description:
 *   Initialize ESP32-S3 SPI Slave hardware interface.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int spislave_initialize(struct spi_slave_ctrlr_s *ctrlr)
{
  uint32_t regval;
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  const struct spislave_config_s *config = priv->config;

  spiinfo("ctrlr=%p\n", ctrlr);

  spislave_gpio_initialize(priv);

  setbits(config->clk_bit, SYSTEM_PERIP_CLK_EN0_REG);
  resetbits(config->rst_bit, SYSTEM_PERIP_RST_EN0_REG);

  /* Configure SPI Slave peripheral */

  putreg32(0, SPI_CLOCK_REG(priv->config->id));

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
  regval = 0;
#else
  regval = SPI_DOUTDIN_M;
#endif
  putreg32(regval, SPI_USER_REG(priv->config->id));

  putreg32(0, SPI_CTRL_REG(priv->config->id));

  regval = SPI_SLAVE_MODE_M;
#ifdef CONFIG_ESP32S3_SPI_DMA
  regval |= SPI_SLV_WRDMA_BITLEN_EN_M | SPI_SLV_RDDMA_BITLEN_EN_M;
#else
  regval |= SPI_SLV_WRBUF_BITLEN_EN_M | SPI_SLV_RDBUF_BITLEN_EN_M;
#endif

  putreg32(regval, SPI_SLAVE_REG(priv->config->id));

  spislave_peripheral_reset(priv);

  /* Use all 64 bytes of the SPI hardware data buffer */

  resetbits(SPI_USR_MISO_HIGHPART_M | SPI_USR_MOSI_HIGHPART_M,
            SPI_USER_REG(priv->config->id));

  /* Disable interrupts */

  resetbits(SPI_INT_MASK, SPI_DMA_INT_ENA_REG(priv->config->id));

#ifdef CONFIG_ESP32S3_SPI_DMA
  if (spislave_dma_init(priv) != OK)
    {
      setbits(priv->config->clk_bit, SYSTEM_PERIP_RST_EN0_REG);
      resetbits(priv->config->clk_bit, SYSTEM_PERIP_CLK_EN0_REG);
      return ERROR;
    }
#endif

  esp_gpioirqenable(config->cs_pin);

  /* Force a transaction done interrupt.
   * This interrupt won't fire yet because we initialized the SPI interrupt
   * as disabled. This way, we can just enable the SPI interrupt and the
   * interrupt handler will kick in, handling any transactions that are
   * queued.
   */

#ifdef CONFIG_ESP32S3_SPI_IO_QIO
  regval = SPI_SLV_INT_EN;
#else
  regval = SPI_TRANS_DONE_INT_ENA_M;
#endif
  setbits(regval, SPI_DMA_INT_RAW_REG(priv->config->id));
  setbits(regval, SPI_DMA_INT_ENA_REG(priv->config->id));

  return OK;
}

/****************************************************************************
 * Name: spislave_deinitialize
 *
 * Description:
 *   Deinitialize ESP32-S3 SPI Slave hardware interface.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spislave_deinitialize(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;

  esp_gpioirqdisable(priv->config->cs_pin);

  /* Disable the trans_done interrupt */

  resetbits(SPI_TRANS_DONE_INT_ENA_M, SPI_DMA_INT_ENA_REG(priv->config->id));

#ifdef CONFIG_ESP32S3_SPI_DMA
  spislave_dma_deinit(priv);
  priv->rx_dma_offset = 0;
#endif

  setbits(priv->config->clk_bit, SYSTEM_PERIP_RST_EN0_REG);
  resetbits(priv->config->clk_bit, SYSTEM_PERIP_CLK_EN0_REG);

  priv->mode = SPISLAVE_MODE0;
  priv->nbits = 0;
  priv->tx_length = 0;
  priv->rx_length = 0;
  priv->is_processing = false;
  priv->is_tx_enabled = false;
}

/****************************************************************************
 * Name: spislave_bind
 *
 * Description:
 *   Bind the SPI Slave device interface to the SPI Slave controller
 *   interface and configure the SPI interface. Upon return, the SPI
 *   slave controller driver is fully operational and ready to perform
 *   transfers.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *   dev   - SPI Slave device interface instance
 *   mode  - The SPI mode requested
 *   nbits - The number of bits requests.
 *            If value is greater than 0, then it implies MSB first
 *            If value is less than 0, then it implies LSB first with -nbits
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *   This implementation currently supports only positive "nbits" values,
 *   i.e., it always configures the SPI Slave controller driver as MSB first.
 *
 ****************************************************************************/

static void spislave_bind(struct spi_slave_ctrlr_s *ctrlr,
                          struct spi_slave_dev_s *dev,
                          enum spi_slave_mode_e mode,
                          int nbits)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  const void *data = NULL;
  irqstate_t flags;
  size_t num_words;

  spiinfo("ctrlr=%p dev=%p mode=%d nbits=%d\n", ctrlr, dev, mode, nbits);

  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(priv->dev == NULL);
  DEBUGASSERT(dev != NULL);
  DEBUGASSERT(nbits > 0);

  flags = spin_lock_irqsave(&priv->lock);

  priv->dev = dev;

