apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_slave.c
static size_t spislave_qpoll(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  irqstate_t flags;
  uint32_t tmp;
  uint32_t recv_n;
  size_t remaining_words;

  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(priv->dev != NULL);

  spiinfo("ctrlr=%p\n", ctrlr);

  flags = spin_lock_irqsave(&priv->lock);

  tmp = SPIS_DEV_RECEIVE(priv->dev, priv->rx_buffer,
                         BYTES2WORDS(priv, priv->rx_length));
  if (tmp)
    {
      recv_n = WORDS2BYTES(priv, tmp);
      if (recv_n < priv->rx_length)
        {
          /* If the upper layer does not receive all of the data from the
           * receive buffer, move the remaining data to the head of the
           * buffer.
           */

          priv->rx_length -= recv_n;
          memmove(priv->rx_buffer, priv->rx_buffer + recv_n,
                  priv->rx_length);
        }
      else
        {
          priv->rx_length = 0;
        }

  #ifdef CONFIG_ESP32S3_SPI_DMA
      spislave_setup_rx_dma(priv);
  #endif
    }

  remaining_words = BYTES2WORDS(priv, priv->rx_length);

  spin_unlock_irqrestore(&priv->lock, flags);

  return remaining_words;
}

/****************************************************************************
 * Name: esp32s3_spislave_ctrlr_initialize
 *
 * Description:
 *   Initialize the selected SPI Slave bus.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple SPI Slave interfaces)
 *
 * Returned Value:
 *   Valid SPI Slave controller structure reference on success;
 *   NULL on failure.
 *
 ****************************************************************************/

struct spi_slave_ctrlr_s *esp32s3_spislave_ctrlr_initialize(int port)
{
  struct spi_slave_ctrlr_s *spislave_dev;
  struct spislave_priv_s *priv;
  irqstate_t flags;
  int ret;

  switch (port)
    {
#ifdef CONFIG_ESP32S3_SPI2
      case ESP32S3_SPI2:
        priv = &esp32s3_spi2slave_priv;
        break;
#endif
#ifdef CONFIG_ESP32S3_SPI3
      case ESP32S3_SPI3:
        priv = &esp32s3_spi3slave_priv;
        break;
#endif
      default:
        return NULL;
    }

  spislave_dev = (struct spi_slave_ctrlr_s *)priv;

  flags = spin_lock_irqsave(&priv->lock);

  if ((volatile int)priv->refs != 0)
    {
      spin_unlock_irqrestore(&priv->lock, flags);

      return spislave_dev;
    }

  /* Attach IRQ for CS pin interrupt */

  ret = esp_gpio_irq(priv->config->cs_pin,
                     spislave_cs_interrupt,
                     priv);
  if (ret < 0)
    {
      spierr("esp_gpio_irq() failed: %d\n", ret);
      leave_critical_section(flags);
      return NULL;
    }

  priv->cpu = this_cpu();
  priv->cpuint = esp_setup_irq(priv->config->periph,
                               ESP32S3_INT_PRIO_DEF,
                               ESP_IRQ_TRIGGER_LEVEL,
                               spislave_periph_interrupt,
                               priv);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type. */

      spin_unlock_irqrestore(&priv->lock, flags);

      return NULL;
    }

  priv->refs++;

  spin_unlock_irqrestore(&priv->lock, flags);

  return spislave_dev;
}

/****************************************************************************
 * Name: esp32s3_spislave_ctrlr_uninitialize
 *
 * Description:
 *   Uninitialize an SPI Slave bus.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   Zero (OK) is returned on success. Otherwise -1 (ERROR).
 *
 ****************************************************************************/

int esp32s3_spislave_ctrlr_uninitialize(struct spi_slave_ctrlr_s *ctrlr)
{
  struct spislave_priv_s *priv = (struct spislave_priv_s *)ctrlr;
  irqstate_t flags;

  DEBUGASSERT(ctrlr != NULL);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = spin_lock_irqsave(&priv->lock);

  if (--priv->refs)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return OK;
    }

  up_disable_irq(priv->config->irq);
  esp_teardown_irq(priv->config->periph, priv->cpuint);
  priv->cpuint = -ENOMEM;

  spislave_deinitialize(ctrlr);

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

#endif /* defined(CONFIG_ESP32S3_SPI) && defined (CONFIG_SPI_SLAVE) */
